



Network Working Group                                              X. Xu
Internet-Draft                                               Alibaba Inc
Intended status: Standards Track                                 S. Kini
Expires: October 30, 2020
                                                               P. Psenak
                                                             C. Filsfils
                                                            S. Litkowski
                                                     Cisco Systems, Inc.
                                                                M. Bocci
                                                                   Nokia
                                                          April 28, 2020


  Signaling Entropy Label Capability and Entropy Readable Label Depth
                              Using IS-IS
                      draft-ietf-isis-mpls-elc-12

Abstract

   Multiprotocol Label Switching (MPLS) has defined a mechanism to load-
   balance traffic flows using Entropy Labels (EL).  An ingress Label
   Switching Router (LSR) cannot insert ELs for packets going into a
   given Label Switched Path (LSP) unless an egress LSR has indicated
   via signaling that it has the capability to process ELs, referred to
   as the Entropy Label Capability (ELC), on that tunnel.  In addition,
   it would be useful for ingress LSRs to know each LSR's capability for
   reading the maximum label stack depth and performing EL-based load-
   balancing, referred to as Entropy Readable Label Depth (ERLD).  This
   document defines a mechanism to signal these two capabilities using
   IS-IS.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on October 30, 2020.




Xu, et al.              Expires October 30, 2020                [Page 1]

Internet-Draft     Signaling ELC and ERLD using IS-IS         April 2020


Copyright Notice

   Copyright (c) 2020 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (https://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2
   2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   3
   3.  Advertising ELC Using IS-IS . . . . . . . . . . . . . . . . .   3
   4.  Advertising ERLD Using IS-IS  . . . . . . . . . . . . . . . .   4
   5.  Signaling ELC and ERLD in BGP-LS  . . . . . . . . . . . . . .   4
   6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   4
   7.  Security Considerations . . . . . . . . . . . . . . . . . . .   5
   8.  Contributors  . . . . . . . . . . . . . . . . . . . . . . . .   5
   9.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .   6
   10. References  . . . . . . . . . . . . . . . . . . . . . . . . .   6
     10.1.  Normative References . . . . . . . . . . . . . . . . . .   6
     10.2.  Informative References . . . . . . . . . . . . . . . . .   7
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .   7

1.  Introduction

   [RFC6790] describes a method to load-balance Multiprotocol Label
   Switching (MPLS) traffic flows using Entropy Labels (EL).  It also
   introduces the concept of Entropy Label Capability (ELC) and defines
   the signaling of this capability via MPLS signaling protocols.
   Recently, mechanisms have been defined to signal labels via link-
   state Interior Gateway Protocols (IGP) such as IS-IS [RFC8667].  This
   draft defines a mechanism to signal the ELC using IS-IS.

   In cases where LSPs are used (e.g., SR-MPLS [RFC8660], it would be
   useful for ingress LSRs to know each intermediate LSR's capability of
   reading the maximum label stack depth and performing EL-based load-
   balancing.  This capability, referred to as Entropy Readable Label
   Depth (ERLD) as defined in [RFC8662] may be used by ingress LSRs to
   determine the position of the EL label in the stack, and whether it's




Xu, et al.              Expires October 30, 2020                [Page 2]

Internet-Draft     Signaling ELC and ERLD using IS-IS         April 2020


   necessary to insert multiple ELs at different positions in the label
   stack.

2.  Terminology

   This memo makes use of the terms defined in [RFC6790], and [RFC8662].

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "NOT RECOMMENDED", "MAY", and
   "OPTIONAL" in this document are to be interpreted as described in BCP
   14 [RFC2119] [RFC8174] when, and only when, they appear in all
   capitals, as shown here.

3.  Advertising ELC Using IS-IS

   Even though ELC is a property of the node, in some cases it is
   advantageous to associate and advertise the ELC with a prefix.  In a
   multi-area network, routers may not know the identity of the prefix
   originator in a remote area, or may not know the capabilities of such
   originator.  Similarly in a multi-domain network, the identity of the
   prefix originator and its capabilities may not be known to the
   ingress LSR.

   Bit 3 in the Prefix Attribute Flags [RFC7794] is used as the ELC Flag
   (E-flag), as shown in Figure 1.  If a router has multiple interfaces,
   the router MUST NOT announce the ELC for any local host prefixes
   unless all of its interfaces are capable of processing ELs.  If a
   router supports ELs on all of its interfaces, it SHOULD set the ELC
   for every local host prefix it advertises in IS-IS.

        0 1 2 3 4 5 6 7...
       +-+-+-+-+-+-+-+-+...
       |X|R|N|E|        ...
       +-+-+-+-+-+-+-+-+...
             Figure 1: Prefix Attribute Flags

             E-flag: ELC Flag (Bit 3) - Set for local host prefix of the
              originating node if it supports ELC on all interfaces.

   When a router propagates a prefix between ISIS levels ([RFC5302], it
   MUST preserve the ELC signaling for this prefix.

   When redistributing a prefix between two IS-IS protocol instances or
   redistributing from another protocol to an IS-IS protocol instance, a
   router SHOULD preserve the ELC signaling for that prefix.  The exact
   mechanism used to exchange ELC between protocol instances running on
   an Autonomous System Boundary Router (ASBR) is outside of the scope
   of this document.



Xu, et al.              Expires October 30, 2020                [Page 3]

Internet-Draft     Signaling ELC and ERLD using IS-IS         April 2020


4.  Advertising ERLD Using IS-IS

   A new MSD-type [RFC8491], called ERLD-MSD is defined to advertise the
   ERLD [RFC8662] of a given router.  A MSD-Type code 2 has been
   assigned by IANA for ERLD-MSD.  The MSD-Value field is set to the
   ERLD in the range between 0 to 255.  The scope of the advertisement
   depends on the application.  If a router has multiple interfaces with
   different capabilities of reading the maximum label stack depth, the
   router MUST advertise the smallest one.

   The absence of ERLD-MSD advertisements indicates only that the
   advertising node does not support advertisement of this capability.

   The considerations for advertising the ERLD are specified in
   [RFC8662].

         0                   1                   2                   3
         0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
        | MSD-Type=TBD2 |     ERLD      |
        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
                         Figure 2: ERLD MSD-Type Format

   If the ERLD-MSD Type is received in the Link MSD Sub-TLV, it MUST be
   ignored.

5.  Signaling ELC and ERLD in BGP-LS

   The IS-IS extensions defined in this document can be advertised via
   BGP-LS [RFC7752] using existing BGP-LS TLVs.

   The ELC is advertised using the Prefix Attribute Flags TLV as defined
   in [I-D.ietf-idr-bgp-ls-segment-routing-ext].

   The ERLD-MSD is advertised using the Node MSD TLV as defined in
   [I-D.ietf-idr-bgp-ls-segment-routing-msd].

6.  IANA Considerations

   Early allocation has been done by IANA for this document as follows:

      - Bit 3 in the Bit Values for Prefix Attribute Flags Sub-TLV
      registry has been assigned to the ELC Flag.  IANA is asked to
      update the registry to reflect the name used in this document: ELC
      Flag (E-flag).






Xu, et al.              Expires October 30, 2020                [Page 4]

Internet-Draft     Signaling ELC and ERLD using IS-IS         April 2020


      - Type 2 in the IGP MSD-Types registry has been assigned for the
      ERLD-MSD.  IANA is asked to update the registry to reflect the
      name used in this document: ERLD-MSD.

7.  Security Considerations

   This document specifies the ability to advertise additional node
   capabilities using IS-IS and BGP-LS.  As such, the security
   considerations as described in [RFC7981], [RFC7752], [RFC7794],
   [RFC8491], [RFC8662], [I-D.ietf-idr-bgp-ls-segment-routing-ext] and
   [I-D.ietf-idr-bgp-ls-segment-routing-msd] are applicable to this
   document.

   Incorrectly setting the E flag during origination, propagation or
   redistribution may lead to black-holing of the traffic on the egress
   node.

   Incorrectly setting of the ERLD value may lead to poor or no load-
   balancing of the traffic.

8.  Contributors

   The following people contributed to the content of this document and
   should be considered as co-authors:



      Gunter Van de Velde (editor)
      Nokia
      Antwerp
      BE

      Email: gunter.van_de_velde@nokia.com


      Wim Henderickx
      Nokia
      Belgium

      Email: wim.henderickx@nokia.com

      Keyur Patel
      Arrcus
      USA

      Email: keyur@arrcus.com





Xu, et al.              Expires October 30, 2020                [Page 5]

Internet-Draft     Signaling ELC and ERLD using IS-IS         April 2020


9.  Acknowledgements

   The authors would like to thank Yimin Shen, George Swallow, Acee
   Lindem, Les Ginsberg, Ketan Talaulikar, Jeff Tantsura, Bruno Decraene
   Carlos Pignataro, Wim Hendrickx, and Gunter Van De Velde for their
   valuable comments.

10.  References

10.1.  Normative References

   [I-D.ietf-idr-bgp-ls-segment-routing-ext]
              Previdi, S., Talaulikar, K., Filsfils, C., Gredler, H.,
              and M. Chen, "BGP Link-State extensions for Segment
              Routing", draft-ietf-idr-bgp-ls-segment-routing-ext-16
              (work in progress), June 2019.

   [I-D.ietf-idr-bgp-ls-segment-routing-msd]
              Tantsura, J., Chunduri, U., Talaulikar, K., Mirsky, G.,
              and N. Triantafillis, "Signaling MSD (Maximum SID Depth)
              using Border Gateway Protocol - Link State", draft-ietf-
              idr-bgp-ls-segment-routing-msd-17 (work in progress),
              April 2020.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.

   [RFC5302]  Li, T., Smit, H., and T. Przygienda, "Domain-Wide Prefix
              Distribution with Two-Level IS-IS", RFC 5302,
              DOI 10.17487/RFC5302, October 2008,
              <https://www.rfc-editor.org/info/rfc5302>.

   [RFC6790]  Kompella, K., Drake, J., Amante, S., Henderickx, W., and
              L. Yong, "The Use of Entropy Labels in MPLS Forwarding",
              RFC 6790, DOI 10.17487/RFC6790, November 2012,
              <https://www.rfc-editor.org/info/rfc6790>.

   [RFC7752]  Gredler, H., Ed., Medved, J., Previdi, S., Farrel, A., and
              S. Ray, "North-Bound Distribution of Link-State and
              Traffic Engineering (TE) Information Using BGP", RFC 7752,
              DOI 10.17487/RFC7752, March 2016,
              <https://www.rfc-editor.org/info/rfc7752>.







Xu, et al.              Expires October 30, 2020                [Page 6]

Internet-Draft     Signaling ELC and ERLD using IS-IS         April 2020


   [RFC7794]  Ginsberg, L., Ed., Decraene, B., Previdi, S., Xu, X., and
              U. Chunduri, "IS-IS Prefix Attributes for Extended IPv4
              and IPv6 Reachability", RFC 7794, DOI 10.17487/RFC7794,
              March 2016, <https://www.rfc-editor.org/info/rfc7794>.

   [RFC7981]  Ginsberg, L., Previdi, S., and M. Chen, "IS-IS Extensions
              for Advertising Router Information", RFC 7981,
              DOI 10.17487/RFC7981, October 2016,
              <https://www.rfc-editor.org/info/rfc7981>.

   [RFC8174]  Leiba, B., "Ambiguity of Uppercase vs Lowercase in RFC
              2119 Key Words", BCP 14, RFC 8174, DOI 10.17487/RFC8174,
              May 2017, <https://www.rfc-editor.org/info/rfc8174>.

   [RFC8491]  Tantsura, J., Chunduri, U., Aldrin, S., and L. Ginsberg,
              "Signaling Maximum SID Depth (MSD) Using IS-IS", RFC 8491,
              DOI 10.17487/RFC8491, November 2018,
              <https://www.rfc-editor.org/info/rfc8491>.

   [RFC8662]  Kini, S., Kompella, K., Sivabalan, S., Litkowski, S.,
              Shakir, R., and J. Tantsura, "Entropy Label for Source
              Packet Routing in Networking (SPRING) Tunnels", RFC 8662,
              DOI 10.17487/RFC8662, December 2019,
              <https://www.rfc-editor.org/info/rfc8662>.

10.2.  Informative References

   [RFC8660]  Bashandy, A., Ed., Filsfils, C., Ed., Previdi, S.,
              Decraene, B., Litkowski, S., and R. Shakir, "Segment
              Routing with the MPLS Data Plane", RFC 8660,
              DOI 10.17487/RFC8660, December 2019,
              <https://www.rfc-editor.org/info/rfc8660>.

   [RFC8667]  Previdi, S., Ed., Ginsberg, L., Ed., Filsfils, C.,
              Bashandy, A., Gredler, H., and B. Decraene, "IS-IS
              Extensions for Segment Routing", RFC 8667,
              DOI 10.17487/RFC8667, December 2019,
              <https://www.rfc-editor.org/info/rfc8667>.

Authors' Addresses

   Xiaohu Xu
   Alibaba Inc

   Email: xiaohu.xxh@alibaba-inc.com






Xu, et al.              Expires October 30, 2020                [Page 7]

Internet-Draft     Signaling ELC and ERLD using IS-IS         April 2020


   Sriganesh Kini

   Email: sriganeshkini@gmail.com


   Peter Psenak
   Cisco Systems, Inc.
   Eurovea Centre, Central 3
   Pribinova Street 10
   Bratislava  81109
   Slovakia

   Email: ppsenak@cisco.com


   Clarence Filsfils
   Cisco Systems, Inc.
   Brussels
   Belgium

   Email: cfilsfil@cisco.com


   Stephane Litkowski
   Cisco Systems, Inc.
   La Rigourdiere
   Cesson Sevigne
   France

   Email: slitkows@cisco.com


   Matthew Bocci
   Nokia
   Shoppenhangers Road
   Maidenhead, Berks
   UK

   Email: matthew.bocci@nokia.com












Xu, et al.              Expires October 30, 2020                [Page 8]
